// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
    let x = +prompt('Чи вірне значення');
    if (x !== 0){
        console.log('Вірно');
    } else if (x === 0){
    console.log('Невірно');
}


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = prompt("До якої чверті години попадає число");
//     if (time >= 0 && time <= 15){
//             console.log('перша');}
//     else if (time >= 16 && time <= 30){
//             console.log('друга');}
//     else if (time >= 31 && time <= 45){
//             console.log('третя');
// }
//     else if (time >= 46 && time <= 59){
//         console.log('четверта');}
//

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt("У яку половну місяця попадає число");
//     if (day >= 0 && day <= 10){
//         console.log('перша');}
//     else if (day >= 11 && day <= 20){
//         console.log('друга');}
//     else if (day >= 21 && day <= 31){
//         console.log('третя');
//     }

//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

// let plan = +prompt("День тижня");
//
//     switch (plan){
//         case 1:
//             console.log('work at home');
//             break;
//         case 2:
//             console.log('go shopping');
//             break;
//         case 3:
//             console.log('go to the salon');
//             break;
//         case 4:
//             console.log('go to the Carpathians');
//             break;
//         case 5:
//             console.log('meet friends');
//             break;
//         case 6:
//             console.log('wclean up at home');
//             break;
//         case 7:
//             console.log('go to a birthday party');
//             break;
//         default:
//             console.log('Невідоме значення');
//     }

//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let y = +prompt("Перше число");
// let z = +prompt("Друге число");
//     y > z ? console.log(y) : console.log(z);
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної  х являється falsy (хибноподыбне, тобто кастується до false)
let x = +prompt("Введіть значення") || 'default';
console.log(x);